#ifndef _Carrier_h_
#define _Carrier_h_

/* 包含头文件 ----------------------------------------------------------------*/
#include "main.h"
#include "Task.h"
#include "Servo.h"
#include "Stepper.h"
/* 类型定义 ------------------------------------------------------------------*/
typedef enum
{
	NO_TASK = 0,
	IN_GETTING_TASK,
	IN_PUTTING_TASK
}Arm_Status_Flag;  //机械臂状态标志位
/* 宏定义 --------------------------------------------------------------------*/
#define IMPACTED  0
#define IN_MOTION 1
/* 扩展变量 ------------------------------------------------------------------*/
extern uint8_t Arm_Status;
/* 函数声明 ------------------------------------------------------------------*/

#endif /* _Carrier_h_ */
/************************************************ 文件结束 ************************************************/

